Repository: Faith842/BizPulse
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: rw

source: you need to provide atleast email and password!!
rw: Ukeneye gutanga byibuze imeyili n'ijambo ry'ibanga!

source: you registered successfully pleas login!!
rw: Wiyandikishije neza, shyiramo amakuru yawe winjire!

source: user already exits login instead!!
rw: Uwo muntu asanzwe ahari, injira (cyangwa shyiramo undi)!

source: please provide your username and password before proceeding!!
rw: Nyamuneka, shyiramo izina ryawe ukoresha n'ijambo ry'ibanga mbere yo gukomeza!

source: invalid email or password!! please check and try again!!
rw: Imeyili cyangwa ijambo ry'ibanga ntibyemewe! Nyamuneka, reba neza wongere ugerageze!

source: you have been logout successfully, you might want to login again
rw: Wasohotse neza, ushobora gushaka kongera kwinjira

source: invalid format!!
rw: Uburyo bw'imiterere ntibwemewe!

source: please provide atleast productname, cost_per_unit,amount, or qauntity
rw: Nyamuneka, tanga byibuze izina ry'igicuruzwa, igiciro ku kigero, igiteranyo (cyangwa umubare), cyangwa ubwinshi!

source: record added successfully
rw: Ibyo wanditse byongeyweho neza

source: no changes detected
rw: Ntampinduka zigaragaye

source: expense updated successfully!
rw: Ibyo uhinduye byahinduwe neza

source: No valid changes detected
rw: Ntampinduka zigaragaye

source: record no longer exists
rw: igicuruzwa nticyicyibaho

source: record deleted successfully
rw: igicuruzwa cyirasibwe neza

source: Invalid date format!
rw: Uburyo bw'imiterere ntibwemewe!

source: Please provide at least product name, price per unit, debit, quantity, and amount
rw: Nyamuneka, tanga byibuze izina ry'igicuruzwa, igiciro ku kigero, igiteranyo (cyangwa umubare), cyangwa ubwinshi!

source: Record added successfully
rw: Ibyo wanditse byongeyweho neza

source: Sale record not found
rw: Ibyanditswe by'Ubucuruzi ntibibonetse

source: No changes detected
rw: Ntampinduka zigaragaye

source: Sale updated successfully!
rw: Ibyo uhinduye byahinduwe neza

source: Record no longer exists
rw: igicuruzwa nticyicyibaho

source: Record deleted successfully
rw: igicuruzwa cyirasibwe neza

source: Please provide at least product name, stock status, quantity, and buying price
rw: Nyamuneka, tanga byibuze izina ry'igicuruzwa, igiciro ku kigero, igiteranyo (cyangwa umubare), cyangwa ubwinshi!

source: Welcome
rw: Murakaza Neza

source: Welcome to
rw: Murakaza Neza Kuri

source: Let’s get to know your business better.
rw: Reka tumenye Business yawe neza

source: Your Name
rw: Izina ryawe

source: Enter your name
rw: shyiramo izina ryawe

source: Company Name
rw: Izina rya business yawe

source: Enter your company name
rw: izina ryabusiness yawe

source: Years of Operation
rw: Imwaka business imaze ikora

source: e.g., 2
rw: urugero: 2

source: Preferred Currency
rw: ifaranga ushaka gukoresha

source: Select Currency
rw: hitamo ifaranga

source: Rwandan Francs (RWF)
rw: amafaranga y'urwanda

source: US Dollars (USD)
rw: amadolari

source: Total Income (Last 2 Years)
rw: inyungu murirusange (imyaka ibiri ishyize)

source: Enter amount
rw: shyiramo amafranga

source: Total Expenses (Last 2 Years)
rw: Ibyo wasohoye mumyaka ibiri ishyize

source: Save info
rw: Bika Ibyanditswe

source: Business Summary
rw: Incamake ya business

source: Name:
rw: Izina

source: Company:
rw: Business

source: Years Active:
rw: Imyaka Imaze ikora

source: Currency:
rw: ifaranga

source: Total Income:
rw: inyungu murirusange

source: Total Expenses:
rw: Ibyasohotse muri rusange

source: Profit:
rw: inyungu

source: Back to Home
rw: Subira Inyuma

source: Filter by Date Range
rw: Soba Ukurikije Urwego rw'Itariki

source: Current Month
rw: uku kwezi

source: Last Month
rw: ukwezi gushyize

source: Last 3 Months
rw: amezi atandatu ashize

source: Last 6 Months
rw: amezi atandatu ashize

source: Current Yea
rw: uyumwaka

source: Custom Range
rw: Urwego Wahisemo Wowe

source: to
rw: Ku

source: Apply Filter
rw: Shyiramo Urusobanya

source: Reset
rw: siba

source: Total Balance
rw: amafaranga yose

source: Current Period
rw: muri kigihe

source: Total Revenue
rw: Ibyasohotse muri rusange

source: Total Expenses
rw: Ibyasohotse muri rusange

source: Net Profit
rw: inyungu

source: Revenue vs Expenses Over Time
rw: Ibyinjiye nibyasohotse ku gihe

source: Top Five Expenses
rw: Bitanubyambere byaguzwe

source: Loading...
rw: tegereza

source: Top Five Sales
rw: Bitanubyambere byasohotse

source: October’s Revenue
rw: Ibyinjiye muri Nyakanga

source: BIZPULSE Dashboard
rw: BIZPULSE Dashboardi

source: Revenue vs Time
rw: Ibyinjiye ku gihe

source: BIZPULSE - Expenses
rw: BizPulse - Kwinjira

source: search by values eg:cocacola, yes for credit...
rw: Shakisha ukoresheje amagambo nka: cocacola, yego kuri credit...

source: Dashboard
rw: Dashboardi

source: Expenses
rw: Ibyasohotse

source: Sales
rw: Ibyinjiye

source: Stock
rw: Sitoke

source: Visuals
rw: Amashusho

source: Log Out
rw: Sohoka

source: Expenses Overview
rw: Isuzuma ry'Imikoreshereze y'Amafaranga

source: Category
rw: Icyiciro

source: Fixed Expenses
rw: Imikoreshereze Ihoraho

source: Variable Expenses
rw: Imikoreshereze Ihindagurika

source: Product name:
rw: Izina ry'Igicuruzwa:

source: Quantity:
rw: Umubare:

source: Description:
rw: Ibisobanuro:

source: Date:
rw: Itariki:

source: Cost per unit:
rw: Igiciro kuri buri kimwe:

source: Amount:
rw: Umubare w'amafaranga:

source: Yes
rw: Yego

source: Not
rw: Oya

source: payment-method
rw: Uburyo bwo Kwishyura

source: Mobile Money
rw: Mobayilo-Money

source: Cash
rw: Amafaranga

source: Bank
rw: Banki

source: Save Record
rw: Bika Ibyanditswe

source: ID
rw: Nimero

source: Product name
rw: Izina ry'Igicuruzwa

source: Quantity
rw: Umubare

source: Description
rw: Ibisobanuro

source: Date
rw: Itariki

source: Cost per unit
rw: Igiciro kuri buri kimwe:

source: Credit
rw: Kirediti

source: Amount
rw: Umubare w'amafaranga

source: Payment Method
rw: Uburyo bwo Kwishyura

source: Product
rw: Izina ry'Igicuruzwa

source: Qty
rw: Ingano

source: Payment
rw: Uburyo bwo Kwishyura

source: Price/Unit
rw: Igiciro kuri buri kimwe

source: Actions
rw: Ibikorwa

source: Edit
rw: Hindura

source: Remove
rw: Siba

source: View All
rw: Reba Byose

source: No results found.
rw: ntago bibonetse

source: No results found.
rw: Ntabisubizo bibonetse

source: Expense Analysis by Product
rw: Isesengura ry'Ibyatanzwe ku bicuruzwa

source: A visual summary of your recorded business expenses to help you monitor spending and improve financial decisions.
rw: Isuzuma ry'ibishushanyo by'imikoreshereze y'amafaranga yawe kugirango ukurikirane uko amafaranga akoreshwa kandi wunguke mu byemezo by’imari.

source: Confirm Deletion
rw: Emeza Gusiba

source: Are you sure you want to delete this expense record?
rw: Uremeza ko ushaka gusiba aya mafaranga yakoreshejwe?

source: Cancel
rw: bireke

source: Delete
rw: siba

source: BizPulse - Login
rw: BizPulse - Kwinjira

source: gradient
rw: Gradienti

source: Welcome!
rw: Murakaza neza!

source: We’re delighted to have you here.
rw: Turishimye kubakira hano.

source: Username
rw: Izina ry'umukoresha

source: Password
rw: Ijambo ry'ibanga

source: Login
rw: Injira

source: Don’t have an account?
rw: Nta konte ufite?

source: Sign Up
rw: Iyandikishe

source: BIZPULSE - Sales
rw: BizPulse - Ibyagirishijwe

source: search by values eg:cocacola, yes for debit...
rw: Shakisha ukoresheje amagambo nka: cocacola, yego kuri credit...

source: Sales Records
rw: Ibyanditswe by'Ubucuruzi

source: Add and track all sales transactions to maintain accurate and up-to-date business performance data.
rw: Ongeramo kandi ukurikirane ibikorwa byose by'ubucuruzi kugirango ube ufite amakuru y'ukuri kandi agezweho.

source: Price per unit
rw: Igiciro kuri buri kimwe

source: Debit
rw: ideni

source: debit
rw: debite

source: yes
rw: Yego

source: Save record
rw: Bika Ibyanditswe

source: id
rw: Nimero

source: Price_per_unit
rw: Igiciro kuri buri kimwe

source: Sales Performance Overview
rw: Isuzuma ry'Uko Ubucuruzi Bukora

source: A graphical view of your sales trends to help you analyze growth, demand, and revenue patterns.
rw: Ishusho yerekana uko ubucuruzi bukora kugirango ufate ibyemezo byiza ku mikurire, ubusabe n’inyungu.

source: BizPulse - Sign Up
rw: BizPulse - Iyandikishe

source: Email
rw: Imeli

source: Already have an account?
rw: Usanzwe ufite konte?

source: Search something here...
rw: shaka Igicuruzwa hano

source: Monitor and manage your inventory levels efficiently to reduce shortages and support smooth business operations.
rw: Kurikira kandi uyobore neza urwego rw'ibicuruzwa byawe kugira ngo ugabanye ibibura kandi ufashe imikorere myiza y'ubucuruzi.

source: Stock Overview
rw: Isuzuma ry'Imikoreshereze y'sitoke

source: stock status
rw: uko sitoke ihagaze

source: Stock-Out
rw: Sitoke isohotse

source: Stock-In
rw: Sitoke yinjiye

source: buyingprice:
rw: igicirobyaguzweho

source: quantity:
rw: Umubare:

source: save record
rw: Bika Ibyanditswe

source: buying price
rw: igiciro byaguzweho

source: quantity
rw: Umubare

source: Stock Analysis
rw: Isesengura ry'Ibicuruzwa

source: An overview of your current inventory status to help you make informed restocking and supply decisions.
rw: Incamake y’urumuri rw’ibicuruzwa ufite ubu, igufasha gufata ibyemezo byizewe byo kongera ibicuruzwa no gutanga ibyo ufite.

source: Explore visual insights that help you understand your business performance at a glance.
rw: Sura ibishushanyo bigufasha gusobanukirwa uko ubucuruzibukora mu buryo bwihuse.

source: debit/credit
rw: Kirediti cg ideni

source: Hey! Yes, You.
rw: Hallo! Yego, Wowe

source: Tired of losing time on manual bookkeepieng?
rw: Unanijwe no gutakaza igihe ukora ibikorwa byo kubika inyandiko ku buryo bwa gakondo?

source: Track sales, manage stock, and make smarter decisions with BizPulse
rw: Kurikirana ibicuruzwa, tegeka ububiko, kandi ufate ibyemezo byubaka ukoresheje BizPulse

source: I'm In!
rw: Ndimo!

source: Count Me In
rw: Mumbaremo Nange

source: Why use it?
rw: Kubericyi wakoresha BizPulse

source: Easy to use
rw: Biroroshye kuyikoresha

source: Manage your accounts and stock without any confusion
rw: Tegura konti n’ububiko bwawe utagira urujijo

source: Everything in one place
rw: Byose hamwe ahantu hamwe

source: Track sales, stock, profits, and investments
rw: Kurikirana ibicuruzwa, ububiko, inyungu, n’ishoramari

source: everything in a single app
rw: Byose muri porogaramu imwe

source: Secure
rw: Bifite umutekano

source: Your data is protected, giving you peace of mind while running your business
rw: Amakuru yawe arinzwe, bikaguha ituze mu mutima igihe uri mu bikorwa by’ubucuruzi bwawe.

source: Ready to get started?
rw: Witeguye gutangira?

source: Join Now
rw: Injira Ubu

source: We got you
rw: Turagufasha

source: 2024 BizPulse. All rights reserved.
rw: 2024 BizPulse. Uburenganzira bwose burabitswe
